In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(0) # to get same random numbers

In [4]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])# EACH OF THE COLUMN IS A PANDA SERIES

In [5]:
  df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [6]:
df['X']

A    0.400157
B   -0.977278
C    0.410599
D    0.121675
E   -0.205158
Name: X, dtype: float64

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
df[['X','W']]

          X         W
A  0.400157  1.764052
B -0.977278  1.867558
C  0.410599 -0.103219
D  0.121675  0.761038
E -0.205158  1.494079

In [10]:
df['new']=df['X'] + df['W']

In [11]:
df

          W         X         Y         Z       new
A  1.764052  0.400157  0.978738  2.240893  2.164210
B  1.867558 -0.977278  0.950088 -0.151357  0.890280
C -0.103219  0.410599  0.144044  1.454274  0.307380
D  0.761038  0.121675  0.443863  0.333674  0.882713
E  1.494079 -0.205158  0.313068 -0.854096  1.288921

In [12]:
df.drop('new',axis=1,inplace=True)# inplace is set true to permanently remove new from df

In [13]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [14]:
df.drop('E',axis=0,)

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674

In [15]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [16]:
df.shape

(5, 4)

In [17]:
df.loc['A']

W    1.764052
X    0.400157
Y    0.978738
Z    2.240893
Name: A, dtype: float64

In [18]:
df.loc[['A','B']]# use loc to print index as series and pass the indices as a list

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357

In [19]:
df.iloc[[0,1]] # iloc to print the numerical index

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357

In [20]:
df.loc['B','Y'] #passing 1 row and 1 column

0.9500884175255894

In [21]:
df.loc[['A','B'],['W','Y']] # first pass list of rows then pass list of columns

          W         Y
A  1.764052  0.978738
B  1.867558  0.950088

# conditional selection

In [22]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [23]:
df > 0

       W      X     Y      Z
A   True   True  True   True
B   True  False  True  False
C  False   True  True   True
D   True   True  True   True
E   True  False  True  False

In [24]:
booldf=df >0

In [25]:
df[booldf] # we get values for df >0 and null for df<0

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558       NaN  0.950088       NaN
C       NaN  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079       NaN  0.313068       NaN

In [26]:
df[df>0]

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558       NaN  0.950088       NaN
C       NaN  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079       NaN  0.313068       NaN

In [27]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [28]:
df[df['W']>0]

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [29]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [30]:
df[df['Z']<0]

          W         X         Y         Z
B  1.867558 -0.977278  0.950088 -0.151357
E  1.494079 -0.205158  0.313068 -0.854096

In [31]:
result1=df[df['W']>0]

In [32]:
result1['X']

A    0.400157
B   -0.977278
D    0.121675
E   -0.205158
Name: X, dtype: float64

In [33]:
df[df['W']>0]['X']

A    0.400157
B   -0.977278
D    0.121675
E   -0.205158
Name: X, dtype: float64

In [34]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.400157  0.978738
B -0.977278  0.950088
D  0.121675  0.443863
E -0.205158  0.313068

 MULTIPLE CONDITIONS

In [35]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [36]:
df[(df['W']<1) | (df['Y']<0.5)]

          W         X         Y         Z
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [37]:
df

          W         X         Y         Z
A  1.764052  0.400157  0.978738  2.240893
B  1.867558 -0.977278  0.950088 -0.151357
C -0.103219  0.410599  0.144044  1.454274
D  0.761038  0.121675  0.443863  0.333674
E  1.494079 -0.205158  0.313068 -0.854096

In [38]:
df.reset_index() # to reset the index back to default

  index         W         X         Y         Z
0     A  1.764052  0.400157  0.978738  2.240893
1     B  1.867558 -0.977278  0.950088 -0.151357
2     C -0.103219  0.410599  0.144044  1.454274
3     D  0.761038  0.121675  0.443863  0.333674
4     E  1.494079 -0.205158  0.313068 -0.854096

In [39]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.764052  0.400157  0.978738  2.240893
1     B  1.867558 -0.977278  0.950088 -0.151357
2     C -0.103219  0.410599  0.144044  1.454274
3     D  0.761038  0.121675  0.443863  0.333674
4     E  1.494079 -0.205158  0.313068 -0.854096

TO CREATE NEW INDEX

In [40]:
newind='sa ma ja va ra'.split()

In [41]:
newind

['sa', 'ma', 'ja', 'va', 'ra']

In [42]:
df['Music']=newind

In [43]:
df

          W         X         Y         Z Music
A  1.764052  0.400157  0.978738  2.240893    sa
B  1.867558 -0.977278  0.950088 -0.151357    ma
C -0.103219  0.410599  0.144044  1.454274    ja
D  0.761038  0.121675  0.443863  0.333674    va
E  1.494079 -0.205158  0.313068 -0.854096    ra

In [44]:
df.set_index('Music',inplace=True)

In [45]:
df

              W         X         Y         Z
Music
sa     1.764052  0.400157  0.978738  2.240893
ma     1.867558 -0.977278  0.950088 -0.151357
ja    -0.103219  0.410599  0.144044  1.454274
va     0.761038  0.121675  0.443863  0.333674
ra     1.494079 -0.205158  0.313068 -0.854096

In [53]:
df.sort_values(by=['W','X'],ascending=[False,False])

              W         X         Y         Z
Music
ma     1.867558 -0.977278  0.950088 -0.151357
sa     1.764052  0.400157  0.978738  2.240893
ra     1.494079 -0.205158  0.313068 -0.854096
va     0.761038  0.121675  0.443863  0.333674
ja    -0.103219  0.410599  0.144044  1.454274

In [55]:
df.columns=['U','V','W','X']

In [59]:
df.rename(columns={'U': 'umbu',
                   'V':  'veri'})

           umbu      veri         W         X
Music
sa     1.764052  0.400157  0.978738  2.240893
ma     1.867558 -0.977278  0.950088 -0.151357
ja    -0.103219  0.410599  0.144044  1.454274
va     0.761038  0.121675  0.443863  0.333674
ra     1.494079 -0.205158  0.313068 -0.854096

In [62]:
df.drop(['W','X'],axis=1)

              U         V
Music
sa     1.764052  0.400157
ma     1.867558 -0.977278
ja    -0.103219  0.410599
va     0.761038  0.121675
ra     1.494079 -0.205158

In [78]:
df['V'].max()

0.41059850193837233

In [79]:
iter_example = ['test', 'test2', 'test3']
for idx, val in enumerate(iter_example):
    print(idx)
    print(val)

0
test
1
test2
2
test3

In [80]:
list_comprehension = [i for i in range(5)]
print(list_comprehension)

[0, 1, 2, 3, 4]

In [82]:
df['W'].astype('float')

Music
sa    0.978738
ma    0.950088
ja    0.144044
va    0.443863
ra    0.313068
Name: W, dtype: float64

In [83]:
df.dtypes

U    float64
V    float64
W    float64
X    float64
dtype: object